app/controllers/invitations/books_controller.rb

  def show
    invitation = Invitation.find params[:id]
    venue = invitation.venue
    guests = invitation.guests

    # pass required variables for erb templating
    @guests = invitation.guests.pluck(:name).join(" & ")
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`id` = '6da5beec-aea6-4e25-ac4a-ce4f58240bb0' LIMIT 1
SELECT `guests`.`name` FROM `guests` INNER JOIN `invitation_guests` ON `guests`.`id` = `invitation_guests`.`guest_id` WHERE `invitation_guests`.`invitation_id` = '6da5beec-aea6-4e25-ac4a-ce4f58240bb0'