app/views/invitations/books/show.html.erb

                          </figure>
                          <span><%= invitation.guests.pluck(:name).join(" & ") %></span>
---
SELECT `guests`.`name` FROM `guests` INNER JOIN `invitation_guests` ON `guests`.`id` = `invitation_guests`.`guest_id` WHERE `invitation_guests`.`invitation_id` = '6da5beec-aea6-4e25-ac4a-ce4f58240bb0'